Project/Toir/src/InformationRegisters/торо_Переводы/торо_Переводы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_Переводы</name>
  <resources>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>ID</name>
    <type>
      <types>AnyRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Язык</name>
    <type>
      <types>CatalogRef.торо_Языки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Реквизит</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/CommonModules/торо_ЛокализацияМодификацияФорм/Module.bsl
#Область ПрограммныйИнтерфейс

// [Локализует динамический список произвольной формы (в основном форм списка)] 
Процедура ПеревестиДинамическийСписок(ЭтаФорма, Список, Реквизиты = Неопределено, Метаданные = Неопределено) Экспорт
	Язык = торо_Локализация.ТекущийЯзыкИБ();

	Если Реквизиты <> Неопределено Тогда
		СтроковыеПоля = СтрРазделить(Реквизиты, ",");
		Для каждого Поле Из СтроковыеПоля Цикл
			Элемент = ЭтаФорма.Элементы.Найти(Поле);
			Если Элемент <> Неопределено Тогда
				СтандартныеЗаголовки = Новый Соответствие;
				СтандартныеЗаголовки.Вставить("Наименование", НСтр("en='Name';ru='Наименование'"));
				СтандартныеЗаголовки.Вставить("Код", НСтр("en='Code';ru='Код'"));
				
				Если СтандартныеЗаголовки[Поле] = Неопределено Тогда
					Элемент.Заголовок = Метаданные.Реквизиты[Поле].Синоним;
				Иначе
					Элемент.Заголовок = СтандартныеЗаголовки[Поле];
				КонецЕсли; 
			КонецЕсли; 
		КонецЦикла; 
	Иначе
		СтроковыеПоля = Реквизиты;
	КонецЕсли; 
	
	Список.ТекстЗапроса = ПолучитьТекстЗапросаСПереводами(Список.ТекстЗапроса, СтроковыеПоля);
	Список.Параметры.УстановитьЗначениеПараметра("Язык", Язык);
КонецПроцедуры

// [Добавляет реквизиты и элементы на форму торо_ПользовательскиеНастройки] 
Процедура ДобавитьНастройкуЯзыкаВПользовательскихНастройках(ЭтаФорма) Экспорт
	ДобавляемыеРеквизиты = Новый Массив;
	
	ЗаголовокЭлемента = НСтр("es='Idioma de edición';ru='Язык редактирования';en='Editing language'");
	ЯзыкРедактирования = Новый РеквизитФормы("дс_ЯзыкРедактирования",
		Новый ОписаниеТипов("СправочникСсылка.торо_Языки"), , ЗаголовокЭлемента, Истина);
	
	ДобавляемыеРеквизиты.Добавить(ЯзыкРедактирования);
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	ЭлементЯзыкРедактирования = ЭтаФорма.Элементы.Вставить("дс_ЯзыкРедактирования", Тип("ПолеФормы"),
		ЭтаФорма.Элементы.НастройкиТОиР, ЭтаФорма.Элементы.Декорация5);
	ЭлементЯзыкРедактирования.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементЯзыкРедактирования.ПутьКДанным = "дс_ЯзыкРедактирования";
	
	ЭтаФорма.дс_ЯзыкРедактирования = торо_Локализация.ТекущийЯзыкИБ();
КонецПроцедуры

#КонецОбласти 

#Область Вспомогательное

Функция ПолучитьТекстЗапросаСПереводами(ТекстЗапроса, мСтроковыеПоля = Неопределено)
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
	НомерПоследнегоПакета = СхемаЗапроса.ПакетЗапросов.Количество() - 1;
	
	Пакет = СхемаЗапроса.ПакетЗапросов[НомерПоследнегоПакета];
	СтроковыеПоля = ПолучитьСтроковыеПоляИзКолонок(Пакет, мСтроковыеПоля);
	ДобавитьПереводыСтроковыхПолей(Пакет, СтроковыеПоля);
	
	НовыйТекстЗапроса = СхемаЗапроса.ПолучитьТекстЗапроса();

	Возврат НовыйТекстЗапроса;
КонецФункции

Процедура ДобавитьПереводыСтроковыхПолей(Пакет, СтроковыеПоля)
	Оператор = Пакет.Операторы[0];
	Источники = Оператор.Источники;
	ИсходныйИсточник = Источники[0];
	ПсевдонимИсточника = ИсходныйИсточник.Источник.Псевдоним;
	
	Для каждого Поле Из СтроковыеПоля Цикл
		ДобавитьПереводСтроковогоПоля(Источники, ИсходныйИсточник, Оператор, Поле, ПсевдонимИсточника);
	КонецЦикла;
КонецПроцедуры

Процедура ДобавитьПереводСтроковогоПоля(Источники, ИсходныйИсточник, Оператор, Поле, ПсевдонимИсточника)
	ПсевдонимПоля = Поле.Псевдоним;
	ВыбираемоеПоле = Оператор.ВыбираемыеПоля.Найти(ПсевдонимПоля);
	
	ПсевдонимРегистра = СтрШаблон("Переводы_%1", ПсевдонимПоля);
	Выражение = СтрШаблон("ЕСТЬNULL(ВЫРАЗИТЬ(%1.Текст КАК СТРОКА(1000)), %2)", ПсевдонимРегистра, Строка(Поле.Поля[0]));
	Регистр = Источники.Добавить("РегистрСведений.торо_Переводы", ПсевдонимРегистра);
	
	ИсходныйИсточник.Соединения.Добавить(Регистр, СтрШаблон("%1.Ссылка = %2.ID", 	ПсевдонимИсточника, ПсевдонимРегистра));
	ИсходныйИсточник.Соединения.Добавить(Регистр, СтрШаблон("%1.Реквизит = ""%2""", ПсевдонимРегистра, ПсевдонимПоля));
	ИсходныйИсточник.Соединения.Добавить(Регистр, СтрШаблон("%1.Язык = &Язык", 		ПсевдонимРегистра));
	
	Оператор.ВыбираемыеПоля.Установить(Оператор.ВыбираемыеПоля.Индекс(ВыбираемоеПоле), Новый ВыражениеСхемыЗапроса(Выражение));
КонецПроцедуры

Функция ПолучитьСтроковыеПоляИзКолонок(Пакет, мСтроковыеПоля)
	СтроковыеПоля = Новый Массив;
	
	Для каждого Колонка Из Пакет.Колонки Цикл
		Если ЭтоСтроковаяКолонка(Колонка) Тогда
			Если мСтроковыеПоля <> Неопределено  Тогда
				Если мСтроковыеПоля.Найти(Колонка.Псевдоним) <> Неопределено Тогда
					СтроковыеПоля.Добавить(Колонка);
				КонецЕсли; 
			Иначе
				СтроковыеПоля.Добавить(Колонка);
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла;
	
	Возврат СтроковыеПоля;
КонецФункции

Функция ЭтоСтроковаяКолонка(Колонка)
	ЭтоСтроковаяКолонка = Ложь;
	
	Если  ТипЗнч(Колонка) = Тип("КолонкаСхемыЗапроса") 
		И Колонка.ТипЗначения.СодержитТип(Тип("Строка"))
		И Колонка.Псевдоним <> "Номер" 
		И Колонка.Псевдоним <> "Код" Тогда
		ЭтоСтроковаяКолонка = Истина;
	КонецЕсли;
	
	Возврат ЭтоСтроковаяКолонка;
КонецФункции

#КонецОбласти
